questions = [ 
    {
        "text": "Яким має бути візуальний огляд плати KeypadCombi (TOP) перед тестом?",
        "options": [
            ("Бузер", True),
            ("Світлодіоди (1 червоних, 3 зелений)", True),
            ("Клема", True),
            ("Резистор", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом LifeQuality?",
        "options": [
            ("СО2 сенсор", True),
            ("Камера диму", True),
            ("Датчик Sensirion", True),
            ("Конденсатор живлення", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту МotionCam Fibra:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Живлення 220V", True),
            ("Кабель USB Type-C", True),
            ("Кронштейн", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом МotionCam Fibra?",
        "options": [
            ("Клема", True),
            ("Фототранзистор", True),
            ("ІЧ світлодіод", True),
            ("Кнопка RESET", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Hub перед тестом?",
        "options": [
            ("Роз'єм живлення", True),
            ("Роз'єм для SIM-holder", True),
            ("Кварцовий резонатор", True),
            ("Слот microSD", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Hub Hybrid:",
        "options": [
            ("Антена", True),
            ("2 активовані SIM-картки", True),
            ("Тест-стенд", True),
            ("Мультиметр", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Relay:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Антена", True),
            ("Тест-стенд", True),
            ("Вольтметр", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Relay перед тестом?",
        "options": [
            ("Антена", True),
            ("Світлодіод", True),
            ("Кнопка", True),
            ("Тумблер", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом WTS_PWB?",
        "options": [
            ("Холдер контактних клем", True),
            ("Світлодіод", True),
            ("Клема", True),
            ("Живлення 12V", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Keypad перед тестом?",
        "options": [
            ("Кнопки", True),
            ("Світлодіодна панель", True),
            ("Дросель", True),
            ("Модуль Wi-Fi", False)
        ]
    }
]
questions += [
    {
        "text": "Який має бути візуальний огляд плати ocBridge Plus перед тестом?",
        "options": [
            ("Клема", True),
            ("Холдер \"+\"", True),
            ("Кварцовий резонатор", True),
            ("LED індикатор з пінцетом", False)
        ]
    },
    {
        "text": "Коли потрібно на KeypadPlus знімати наліпки на світлодіодах і світлодіодній панелі?",
        "options": [
            ("Після тестування девайсу", True),
            ("До тесту", False),
            ("Перед візуальним оглядом", False),
            ("Після пакування", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати KeypadPlus перед тестом?",
        "options": [
            ("Світлодіод", True),
            ("Кнопки", True),
            ("Плата СFM", True),
            ("WiFi модуль", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом NVR?",
        "options": [
            ("ЕК (дроселі із крихким керамічним корпусом)", True),
            ("LAN роз'єм", True),
            ("4Pin роз'єми", True),
            ("Світлодіод RESET", False)
        ]
    }
]
questions += [
    {
        "text": "Яким має бути візуальний огляд плати MotionProtect Outdoor MBR перед тестом?",
        "options": [
            ("ІЧ-світлодіоди TOP та BOT", True),
            ("2 холдери \"-\"", True),
            ("Тампер", True),
            ("Клема зовнішнього живлення", True),
            ("2 холдери \"+\"", True),
            ("Кнопка", True),
            ("PIR-сенсор", True),
            ("Світлодіоди", True),
            ("Клема для 5-pin шлейфа", True),
            ("Фотодіод", True),
            ("Реле", False)
        ]
    },
    {
        "text": "Оберіть правильні відповіді стосовно плати МotionCam Fibra:",
        "options": [
            ("Для тесту MCF потрібно під'єднати 20pin, 24pin та 3pin шлейфи", True),
            ("Протестовані плати передаються на складання з 20pin шлейфом", True),
            ("Заборонено зберігати MCF MBR ІЧ світлодіодом до поверхні столу", True),
            ("Світлодіоди не впливають на роботу MCF", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту HomeSiren:",
        "options": [
            ("Тест-стенд", True),
            ("Заглушка", True),
            ("Живлення 220V", True),
            ("Антена", True),
            ("Ethernet/RS-485", True),
            ("Wi-Fi модуль", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Hub:",
        "options": [
            ("SIM холдер", True),
            ("Ethernet/RS-485", True),
            ("Антена", True),
            ("Тест-стенд", True),
            ("Живлення 220V", True),
            ("Картрідер", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тестування DoorProtect v3:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Живлення 220V", True),
            ("Кабель USB Type-C", True),
            ("Антена", True),
            ("Тест-стенд", True),
            ("Кронштейн", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати DoorProtect перед тестуванням?",
        "options": [
            ("Холдер \"-\"", True),
            ("Геркон", True),
            ("Вмикач", True),
            ("Тампер", True),
            ("Світлодіод", True),
            ("Клема", True),
            ("Антена", True),
            ("Холдер \"+\"", True),
            ("Конденсатор", False)
        ]
    }
]
questions += [
    {
        "text": "Оберіть девайси, на яких не потрібно підгинати тампер за допомогою оснастки:",
        "options": [
            ("Потрібно на усіх", True),
            ("На Keypad не потрібно", False),
            ("На Hub підгинати заборонено", False),
            ("На DoorProtect підгинати тільки вручну", False)
        ]
    }
]
questions += [
    {
        "text": "Яким має бути візуальний огляд плати LeaksProtect перед тестом?",
        "options": [
            ("Зовнішні контакти", True),
            ("Антена", True),
            ("Холдер \"+\"", True),
            ("Тампер", True),
            ("Світлодіод", True),
            ("Кварцевий резонатор", True),
            ("Холдер \"-\"", True),
            ("Слот SIM-карти", False)
        ]
    }
]
questions += [
    {
        "text": "Що таке PhOD?",
        "options": [
            ("Режим роботи, коли датчик робить фото на вимогу", True),
            ("Спеціальний режим для тестування живлення", False),
            ("Режим для зчитування QR-коду", False),
            ("Протокол передачі даних між датчиком і сервером", False)
        ]
    }
]
questions += [
    {
        "text": "Перед запуском тесту HomeSiren потрібно:",
        "options": [
            ("Прибрати зайвий текстоліт за допомогою бокорізів", True),
            ("Зачистити тестпоінти від зайвого лаку", True),
            ("Виконати візуальний огляд на предмет відсутності механічних пошкоджень на платі", True),
            ("Виконати візуальний огляд на наявність та цілісність всіх компонентів", True),
            ("Вставити заглушку", True),
            ("Перевірити наявність захисного лакового покриття", True),
            ("Зісканувати QR-код для початку тесту в Shipyard", True),
            ("Перевірити наявність слідів води", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Hub Hybrid:",
        "options": [
            ("Антена", True),
            ("Ethernet/RS-485", True),
            ("Тест-стенд", True),
            ("Живлення 220V", True),
            ("2 активовані SIM-картки", True),
            ("HDMI кабель", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту DualCurtainOutdoor:",
        "options": [
            ("Тест-стенд", True),
            ("Ethernet/RS-485", True),
            ("Антена", True),
            ("Живлення 220V", True),
            ("USB-хаб", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати PWBv4 перед тестом?",
        "options": [
            ("AC\\DC перетворювач", True),
            ("Електролітичні конденсатори", True),
            ("Трансформатор", True),
            ("Вхідний фільтр", True),
            ("Мікросхема керування", True),
            ("Роз'єм для живлення 220V", True),
            ("Сонячна батарея", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту KeypadPlus:",
        "options": [
            ("Антена", True),
            ("Кабель USB Type-C", True),
            ("Живлення 220V", True),
            ("Тест-стенд", True),
            ("Ethernet/RS-485", True),
            ("Мережевий фільтр", False)
        ]
    },
    {
        "text": "В чому полягає відмінність між платами MotionCam Outdoor та MotionCam Outdoor PhOD?",
        "options": [
            ("Версія плати", True),
            ("Колір плати", False),
            ("Матеріал корпусу", False),
            ("Наявність світлодіодів", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати MotionProtect Outdoor MBR перед тестом?",
        "options": [
            ("2 холдери \"+\"", True),
            ("Клема для 5-pin шлейфа", True),
            ("PIR-сенсор", True),
            ("2 холдери \"-\"", True),
            ("ІЧ-світлодіоди TOP та BOT", True),
            ("Тампер", True),
            ("Клема зовнішнього живлення", True),
            ("Світлодіоди", True),
            ("Кнопка", True),
            ("Фотодіод", True),
            ("SIM-слот", False)
        ]
    },
    {
        "text": "Перед запуском тестування KeypadPlus потрібно:",
        "options": [
            ("Зачистити ТП від зайвого лаку", True),
            ("Виконати візуальний огляд на наявність та цілісність всіх компонентів", True),
            ("Виконати візуальний огляд на предмет відсутності механічних пошкоджень на платі", True),
            ("Прибрати зайвий текстоліт за допомогою бокорізів", True),
            ("Зісканувати QR-код для початку тесту в Shipyard", True),
            ("Під'єднати Ethernet кабель", False)
        ]
    }
]
questions += [
    {
        "text": "Яким має бути візуальний огляд плати Hub 2 перед тестом?",
        "options": [
            ("Кварцевий резонатор", True),
            ("Тампер", True),
            ("Кнопка", True),
            ("Клема для аккумулятора", True),
            ("Роз'єм Ethernet/LAN", True),
            ("Роз'єм живлення", True),
            ("Світлодіоди", True),
            ("2 роз'єми SIM-holder", True)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту WaterStop MBR:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Антена", True),
            ("Тест-стенд", True),
            ("Кабель USB Type-C", True)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту MotionCam Outdoor:",
        "options": [
            ("Тест-стенд", True),
            ("Антена", True),
            ("Ethernet/RS-485", True),
            ("Живлення 220V", True)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати PWBv1 перед тестом?",
        "options": [
            ("Роз'єм для живлення 220V", True),
            ("Трансформатор", True),
            ("Вхідний фільтр", True),
            ("Мікросхема керування", True),
            ("AC\\DC перетворювач", True),
            ("Електролітичні конденсатори", True)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Hyb Hybrid перед тестом?",
        "options": [
            ("Клема для аккумулятора", True),
            ("Перетворювач напруги AС220В-->15DC", True),
            ("Клема для живлення 220V", True),
            ("RFM-модуль", True),
            ("Роз'єм SIM-холдер", True),
            ("Кнопка", True),
            ("Клема", True),
            ("Роз'єм Ethernet/LAN", True),
            ("Кварцевий резонатор", True),
            ("Клемник для підключення зовнішніх пристроїв", True),
            ("Дросель", True),
            ("Конденсатор", True),
            ("Тампер", True),
            ("Світлодіоди", True)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати ReX 2 перед тестом?",
        "options": [
            ("Кварцовий резонатор", True),
            ("Тампер", True),
            ("Роз'єм живлення", True),
            ("Роз'єм Ethernet/LAN", True),
            ("Світлодіоди", True),
            ("Кнопка", True),
            ("Клема для аккумулятора", True)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати MotionCam Outdoor перед тестом?",
        "options": [
            ("Холдер \"-\"", True),
            ("Коннектор для 2-pin шлейфа", True),
            ("Коннектор для 5-pin шлейфа", True),
            ("ІЧ-світлодіод", True),
            ("Холдер \"+\"", True),
            ("PIR-сенсор", True),
            ("Тампер", True),
            ("Кнопки", True),
            ("Світлодіоди", True),
            ("Коннектор для 20-pin шлейфа", True),
            ("Фотодіод", True)
        ]
    }
]
questions += [
    {
        "text": "В чому полягає відмінність між платами Hub 2 Plus та Hub 2 4G?",
        "options": [
            ("Версія плати", True),
            ("В версії Hub 2 4G присутній лише 1 зовнішній контакт антени", True),
            ("QR-код", True),
            ("Наявність LED-екрана", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати DualCurtainOutdoor перед тестом?",
        "options": [
            ("PIR-сенсор", True),
            ("ІЧ-світлодіод", True),
            ("Кнопка", True),
            ("Тампер", True),
            ("Холдер +", True),
            ("Світлодіоди", True),
            ("Холдер -", True),
            ("Фототранзистор", True),
            ("Аудіо модуль", False)
        ]
    },
    {
        "text": "Перед запуском тесту HomeSiren потрібно:",
        "options": [
            ("Зачистити тестпоінти від зайвого лаку", True),
            ("Вставити заглушку", True),
            ("Виконати візуальний огляд на наявність та цілісність всіх компонентів", True),
            ("Перевірити наявність захисного лакового покриття", True),
            ("Зісканувати QR-код для початку тесту в Shipyard", True),
            ("Прибрати зайвий текстоліт за допомогою бокорізів", True),
            ("Виконати візуальний огляд на предмет відсутності механічних пошкоджень на платі", True),
            ("Під'єднати GPS-модуль", False)
        ]
    },
    {
        "text": "Після завершення тесту MotionCam необхідно:",
        "options": [
            ("Наклеїти QR-код на плату", True),
            ("Зафіксувати решту QR-код згідно інструкції", True),
            ("Поставити плату в палету протестованих пристроїв", True),
            ("Оглянути плату на наявність пошкоджень, що могли виникнути в процесі встановлення/демонтажу плати з тестблоку або під час відкушування зайвого текстоліту", True),
            ("Виконати оновлення ПЗ", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати PWBv1 перед тестом?",
        "options": [
            ("Електролітичні конденсатори", True),
            ("Роз'єм для живлення 220V", True),
            ("AC\\DC перетворювач", True),
            ("Трансформатор", True),
            ("Вхідний фільтр", True),
            ("USB-хост", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом WaterStop MBR?",
        "options": [
            ("Кнопка", True),
            ("Оптичний сенсор", True),
            ("Роз'єм PBD-16", True),
            ("Електролітичні конденсатори", True),
            ("Роз'єм 2pin", True),
            ("Терморезистор", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Hub перед тестом?",
        "options": [
            ("Роз'єм для SIM-holder", True),
            ("Тампер", True),
            ("Кнопка", True),
            ("Кварцовий резонатор", True),
            ("Роз'єм Ethernet/LAN", True),
            ("Світлодіоди", True),
            ("Клема для аккумулятора", True),
            ("Роз'єм живлення", True),
            ("Кнопка Reset", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Keypad:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Антена", True),
            ("Живлення 220V", True),
            ("Тест-стенд", True),
            ("Кронштейн", False)
        ]
    }
]
questions += [
    {
        "text": "Яким має бути візуальний огляд плати Socket перед тестом?",
        "options": [
            ("Клема заземлення", True),
            ("Мікросхема", True),
            ("Антена", True),
            ("Клема антени", True),
            ("Реле", True),
            ("Дросель", True),
            ("USB-порт", False),
            ("Тумблер", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Hub 2:",
        "options": [
            ("2 активовані SIM-картки, котрі вставлені у 2 SIM холдери", True),
            ("Кабель USB Type-C", True),
            ("Тест-стенд", True),
            ("Антена", True),
            ("Ethernet/RS-485", True),
            ("Паяльник", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом LightSwitch MBR ?",
        "options": [
            ("Світлодіоди", True),
            ("Роз'єм", True),
            ("Пінцет", False),
            ("Резистор 470 Ом", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати PWBv4 перед тестом?",
        "options": [
            ("Електролітичні конденсатори", True),
            ("Вхідний фільтр", True),
            ("Роз'єм для живлення 220V", True),
            ("AC\\DC перетворювач", True),
            ("Трансформатор", True),
            ("Мікроконтролер", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати MotionProtect Outdoor MBR перед тестом?",
        "options": [
            ("ІЧ-світлодіод LIQ з фотосенсором", True),
            ("Кнопка", True),
            ("Світлодіоди", True),
            ("2 холдери \"+\"", True),
            ("Тампер", True),
            ("Клема зовнішнього живлення", True),
            ("ІЧ-світлодіоди TOP та BOT", True),
            ("Фотодіод", True),
            ("2 холдери \"-\"", True),
            ("PIR-сенсор", True),
            ("Клема для 5-pin шлейфа", True),
            ("Модем", False)
        ]
    },
    {
        "text": "Перед запуском тесту Keypad потрібно:",
        "options": [
            ("Виконати візуальний огляд на предмет відсутності механічних пошкоджень на платі", True),
            ("Перевірити наявність захисного лакового покриття", True),
            ("Зісканувати QR-код для початку тесту в Shipyard", True),
            ("Зачистити тестпоінти від зайвого лаку", True),
            ("Прибрати зайвий текстоліт за допомогою бокорізів", True),
            ("Виконати візуальний огляд на наявність та цілісність всіх компонентів", True),
            ("Під’єднати навантаження", False)
        ]
    }
]
questions += [
    {
        "text": "Перед запуском тесту KeypadCombi (TOP) потрібно:",
        "options": [
            ("Прибрати зайвий текстоліт за допомогою бокорізів", True),
            ("Виконати візуальний огляд на наявність та цілісність всіх компонентів", True),
            ("Вставити необхідні шлейфи", True),
            ("Перевірити наявність захисного лакового покриття", True),
            ("Зісканувати QR-код для початку тесту в Shipyard", True),
            ("Виконати візуальний огляд на предмет відсутності механічних пошкоджень на платі", True),
            ("Вставити плату в корпус", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Hub Hybrid 4G перед тестом?",
        "options": [
            ("RFM-модуль", True),
            ("Клема для живлення 220В", True),
            ("Роз’єм LAN", True),
            ("Світлодіоди", True),
            ("Клема акумуляторної батареї", True),
            ("Електролітний конденсатор", True),
            ("Перетворювач напруги АС220В-->15 DC", True),
            ("Зовнішня LTE антена", True),
            ("Кварцевий резонатор", True),
            ("Дросель", True),
            ("Тампер", True),
            ("Клемник для підключення зовнішніх пристроїв", True),
            ("Кнопка", True),
            ("Роз’єм SIM холдера", True)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати Multitransmitter перед тестом?",
        "options": [
            ("Полімерний конденсатор", True),
            ("Конденсатори", True),
            ("Перетворювач напруги AC220B-->15 DC", True),
            ("Тампер", True),
            ("Клема для живлення 220V", True),
            ("Кварцовий резонатор", True),
            ("RGB-світлодіод", True),
            ("Кнопка", True),
            ("RFM-модуль", True),
            ("Клема для аккумулятора", True),
            ("Клемник для підключення зовнішніх пристроїв", True),
            ("Дросель", True)
        ]
    },
    {
        "text": "В чому полягає відмінність між платами DoorProtect v8a та DoorProtect v3:",
        "options": [
            ("Прошивка", True),
            ("Версія плати", True),
            ("Відсутність RFM-модуля в версії DPv3", True),
            ("Підтримка SIM-карти", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Hub Hybrid 4G:",
        "options": [
            ("Тест-стенд", True),
            ("Живлення 220V", True),
            ("Антена", True),
            ("Ethernet/RS-485", True),
            ("Сканер штрихкодів", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту NVR:",
        "options": [
            ("Кабель USB Type-C", True),
            ("Ethernet/RS-485", True),
            ("Тест-стенд", True),
            ("Живлення 220V", True),
            ("Миша USB", False)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту Socket:",
        "options": [
            ("Антена", True),
            ("Ethernet/RS-485", True),
            ("Тест-стенд", True),
            ("Живлення 220V", True),
            ("Кабель HDMI", False)
        ]
    }
]
questions += [
    {
        "text": "Необхідне обладнання для тесту WallSwitch:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Антена", True),
            ("Живлення 220V", True),
            ("Тест-стенд", True),
            ("Wi-Fi модуль", False)
        ]
    }
]

