questions = [
    {
        "text": "Яких елементів не вистачає на платі KeyPad?",
        "image": "https://raw.githubusercontent.com/80casper08/Hardtest2.0/main/images/1.jpg",
        "options": [
            ("Холдер '-'", True),
            ("Холдер '+'", True),
            ("Резистор", False),
            ("Світлодіод", True),
            ("Всі є", False)
        ]
    },
    {
        "text": "Яких елементів не вистачає на платі StreetSiren?",
        "image": "https://raw.githubusercontent.com/80casper08/Hardtest2.0/main/images/2.jpg",
        "options": [
            ("Антена", True),
            ("Кнопка", True),
            ("Світлодіод", False),
            ("Кварцовий резонатор", True),
            ("Всі є", False)
        ]
    }
      ]
questions += [
    {
        "text": "Яким має бути візуальний огляд плати KeypadCombi (TOP) перед тестом?",
        "options": [
            ("Бузер", True),
            ("Світлодіоди (1 червоних, 3 зелений)", True),
            ("Клема", True),
            ("Реле", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом LifeQuality?",
        "options": [
            ("СО2 сенсор", True),
            ("Холдер мінусової клеми", True),
            ("Тампер", True),
            ("Камера диму", True),
            ("Роз'єм PBS", True),
            ("Датчик Sensirion", True),
            ("Антена RF", True),
            ("Холдер плюсової клеми", True),
            ("Кнопка", True)
        ]
    },
    {
        "text": "Необхідне обладнання для тесту МotionCam Fibra:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Живлення 220V", True),
            ("Кабель USB Type-C", True),
            ("Тест-стенд", True),
            ("Ватметр", False)
        ]
    },
    {
        "text": "Яким має бути візуальний огляд плати перед тестом МotionCam Fibra?",
        "options": [
            ("Клема", True),
            ("Фототранзистор", True),
            ("ІЧ світлодіод", True),
            ("Клема живлення", True),
            ("Гіроскоп", False)
        ]
    },
    {
        "text": "5) Яким має бути візуальний огляд плати Hub перед тестом?",
        "options": [
            ("Роз'єм живлення", True),
            ("Кнопка", True),
            ("Роз'єм Ethernet/LAN", True),
            ("Роз'єм для SIM-holder", True),
            ("Кварцовий резонатор", True),
            ("Тампер", True),
            ("Клема для аккумулятора", True)
        ]
    },
    {
        "text": "6) Необхідне обладнання для тесту Hub Hybrid:",
        "options": [
            ("Антена", True),
            ("2 активовані SIM-картки", True),
            ("Живлення 220V", True),
            ("Тест-стенд", True),
            ("Ethernet/RS-485", True),
            ("Мультиметр", False)
        ]
    },
    {
        "text": "7) Необхідне обладнання для тесту Relay:",
        "options": [
            ("Ethernet/RS-485", True),
            ("Тест-стенд", True),
            ("Антена", True),
            ("Живлення 220V", True),
            ("Вольтметр", False)
        ]
    },
    {
        "text": "8) Яким має бути візуальний огляд плати Relay перед тестом?",
        "options": [
            ("Антена", True),
            ("Світлодіод", True),
            ("Клема", True),
            ("Кнопка", True)
        ]
    },
    {
        "text": "9) Яким має бути візуальний огляд плати перед тестом WTS_PWB?",
        "options": [
            ("Холдер контактних клем", True),
            ("Світлодіод", True),
            ("Штирі PLS", True),
            ("Клема", True)
        ]
    },
    {
        "text": "10) Яким має бути візуальний огляд плати Keypad перед тестом?",
        "options": [
            ("Кнопки", True),
            ("Холдер \"-\"", True),
            ("Тампер", True),
            ("Холдер \"+\"", True),
            ("Світлодіод", True),
            ("Світлодіодна панель", True),
            ("Дросель", True)
        ]
    }
]
